Verified locally:
```
$ terraform apply -state=terraform.tfstate -var-file=terraform.tfvars

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.api_a_record[0] will be created
  + resource "aws_route53_record" "api_a_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.CLUSTERNAME.BASE_DOMAIN"
      + records         = [
          + "X.Y.Z.B",
        ]
      + ttl             = 60
      + type            = "A"
      + zone_id         = "ZQ6XFE6BKI2L"
    }

  # aws_route53_record.ingress_a_record[0] will be created
  + resource "aws_route53_record" "ingress_a_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.apps.CLUSTERNAME.BASE_DOMAIN"
      + records         = [
          + "X.Y.Z.A",
        ]
      + ttl             = 60
      + type            = "A"
      + zone_id         = "ZQ6XFE6BKI2L"
    }

...

Apply complete! Resources: 11 added, 0 changed, 0 destroyed.
```
The DNS records were correctly created:
![obrazek](https://github.com/red-hat-storage/ocs-ci/assets/4759779/d6575c2a-16f2-4d2f-9f3e-2fcfcd4c9b5b)

Tested also `destroy` which worked as expected.